       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATABASE-MANAGEMENT.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SUPPLY-CHAIN-FILE ASSIGN TO "SUPPLYCHAIN.DAT"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS ITEM-ID
               FILE STATUS IS FS-SUPPLY-CHAIN.

           SELECT BLOCKCHAIN-FILE ASSIGN TO "BLOCKCHAIN.DAT"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS BLOCK-HASH
               FILE STATUS IS FS-BLOCKCHAIN.

           SELECT TRANSACTION-FILE ASSIGN TO "TRANSACTION.DAT"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS TX-ID
               FILE STATUS IS FS-TRANSACTION.

       DATA DIVISION.
       FILE SECTION.

       FD SUPPLY-CHAIN-FILE.
       01 SUPPLY-CHAIN-RECORD-DATA.
           COPY SUPPLY-CHAIN-RECORD.

       FD BLOCKCHAIN-FILE.
       01 BLOCKCHAIN-RECORD-DATA.
           COPY BLOCKCHAIN-RECORD.

       FD TRANSACTION-FILE.
       01 TRANSACTION-RECORD-DATA.
           COPY TRANSACTION-RECORD.

       WORKING-STORAGE SECTION.
       01 FS-SUPPLY-CHAIN      PIC XX.
       01 FS-BLOCKCHAIN        PIC XX.
       01 FS-TRANSACTION       PIC XX.

       PROCEDURE DIVISION.

       OPEN-FILES.
           OPEN I-O SUPPLY-CHAIN-FILE
               BLOCKCHAIN-FILE
               TRANSACTION-FILE.
           PERFORM FILE-STATUS-CHECK.

       CLOSE-FILES.
           CLOSE SUPPLY-CHAIN-FILE
                 BLOCKCHAIN-FILE
                 TRANSACTION-FILE.

       FILE-STATUS-CHECK.
           IF FS-SUPPLY-CHAIN NOT = "00"
               DISPLAY "ERROR IN SUPPLY-CHAIN-FILE: " FS-SUPPLY-CHAIN
           END-IF.
           IF FS-BLOCKCHAIN NOT = "00"
               DISPLAY "ERROR IN BLOCKCHAIN-FILE: " FS-BLOCKCHAIN
           END-IF.
           IF FS-TRANSACTION NOT = "00"
               DISPLAY "ERROR IN TRANSACTION-FILE: " FS-TRANSACTION
           END-IF.

       END PROGRAM DATABASE-MANAGEMENT.
